/*
  ******************************************************************************
  * @file    adc.c
  * @author  xhJiang
  * @version v1.1
  * @date    2018.4.2
  * @mail:   blog_xhjiang@163.com
  * @brief   ADC configure
  ******************************************************************************
  */

#include "KEA128_ADC.h"

//-------------------------------------------------------------------------------------------------------------------
//  @brief      ADC初始化
//  @param      adcn_ch         选择ADC通道
//  @param      bit             选择精度ADC_8bit，精度寄存器为通用寄存器。
//  @return     void
//  @since      v1.0
//  Sample usage:               ADC_Init(ADC0_SE8,ADC_12bit);
//-------------------------------------------------------------------------------------------------------------------
void ADC_Init(ADCn_Chn adcn_chn, ADC_nbit bit)
{
  ASSERT(adcn_ch < ADCn_Ch_MAX ) ;        //检查ADC通道编码有效
  SIM_BASE_PTR->SCGC |= SIM_SCGC_ADC_MASK;         //使能ADC时钟
  ADC_BASE_PTR->APCTL1 |= 1<<adcn_chn;              //禁用ADC引脚的IO功能
//若使用了超频,需要设置ADC的CLK为总线时钟/2,确保
  ADC_BASE_PTR->SC3 = (0                           //ADLPC = 0,低功耗配置禁用，使用高速模式
              | ADC_SC3_ADIV(0)           //分频系数ADIV = 0,分频比1，时钟速率 = 输入时钟
//               |ADC_SC3_ADLSMP_MASK         //使用长采样时间，减低功耗，提高采样精确度
              | ADC_SC3_MODE(bit)         //分辨率
              | ADC_SC3_ADICLK(0)         //使用总线时钟作为时钟源
              );
                                          //ADC->SC3与ADC_SC3相同
  ADC_BASE_PTR->SC2 = (0                            //ADTRG = 0,软件触发；ACFE = 0,比较禁用；
              |ADC_SC2_REFSEL(0)          //默认使用基准电压选择使用外部参考电压 VREFH/VREFL
              );
}


//-------------------------------------------------------------------------------------------------------------------
//  @brief      ADC采样
//  @param      adcn_ch         选择ADC通道
//  @note                       8位模式下最长采样时间为20个ADCK+5个BUS=25个总线周期；10位或12位模式下最长采样时间23个ADCK+5个BUS=28个总线周期
//  @return     void
//  @since      v1.0
//  Sample usage:               uint16 dat = ADC_Read(ADC0_SE8);//采集ADC0_SE8电压，精度12位
//-------------------------------------------------------------------------------------------------------------------
uint16 ADC_Read(ADCn_Chn adcn_chn)
{
    uint16 result = 0;
    ADC_BASE_PTR->SC1 = (ADC_SC1_AIEN_MASK|            //使能转换完成中断
//                                0|            //ADC_SC1_ADCO关闭连续转换,每次对ADC_SC1写操作后启动一次转换
                ADC_SC1_ADCH(adcn_chn)        //选择输入通道
                );
                                              //启动转换,ADC_SC1必须最后配置！
    while(!(ADC_SC1 & ADC_SC1_COCO_MASK)); //等待转换完成
    result = ADC_R;//等效于ADC->R & ADC_R_ADR_MASK
    ADC_SC1 &= ~ADC_SC1_COCO_MASK;   //清空转换完成标志位
    return result;       //返回结果
    
}

//-------------------------------------------------------------------------------------------------------------------
//  @brief      ADC停止采集
//  @param      void
//  @return     void
//  @since      v1.0
//  Sample usage:               ADC_Stop();
//-------------------------------------------------------------------------------------------------------------------
void ADC_Stop(void)
{
    ADC_BASE_PTR->SC1 = ADC_SC1_ADCH(ADC0_DISABLE); //关闭ADC
}


//-------------------------------------------------------------------------------------------------------------------
//  @brief      检查ADC是否正在采集转换
//  @param      void
//  @return     uint8           0表示转换未再进行，1表示转换正在进行（在转换启动时置位，转换完成或终止时清零）
//  @since      v1.0
//  Sample usage:               uint8 adc_flag = ADC_Isacting();
//-------------------------------------------------------------------------------------------------------------------
uint8 ADC_Isacting(void)
{
  uint8 adc_transforming_flag = 0;
  if(ADC_SC2 & ADC_SC2_ADACT_MASK) adc_transforming_flag = TRUE;
  return adc_transforming_flag;
}
              
//-------------------------------------------------------------------------------------------------------------------
//  @brief      配置ADC的FIFO
//  @待更新
//-------------------------------------------------------------------------------------------------------------------
              
//-------------------------------------------------------------------------------------------------------------------
//  @brief      配置引脚控制，禁用模拟输入的引脚IO端口控制
//  @ADC_APCTL1 待更新
//-------------------------------------------------------------------------------------------------------------------
